Autodesk.Revit.DB.ExternalService.ServerChangeCause
Since:
2013
Indicates the cause for the active server to be changed
Since:
2013

Autodesk.Revit.DB.ExternalService.ServerChangeCause.UserChange
The change of the active server has been explicitly requested by the end user.

Autodesk.Revit.DB.ExternalService.ServerChangeCause.ImposedChange
The active server is being changed as a result of other operations in Revit.